app/views/visitors/index.html.erb

        <div class="page-heading">
         	<h1>Welcome<small><%= link_to 'Users:', users_path %> <%= User.count %> registered</small></h1>
---
SELECT COUNT(*) FROM "users"